{
  "additional_special_tokens": [
    {
      "__type": "AddedToken",
      "content": "<ent>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false
    },
    {
      "__type": "AddedToken",
      "content": "<ent2>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false
    },
    {
      "__type": "AddedToken",
      "content": "<ent>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false
    },
    {
      "__type": "AddedToken",
      "content": "<ent2>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false
    },
    {
      "__type": "AddedToken",
      "content": "<ent>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false
    },
    {
      "__type": "AddedToken",
      "content": "<ent2>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false
    }
  ],
  "bos_token": "<s>",
  "clean_up_tokenization_spaces": true,
  "cls_token": "<s>",
  "entity_mask2_token": "[MASK2]",
  "entity_mask_token": "[MASK]",
  "entity_pad_token": "[PAD]",
  "entity_token_1": {
    "__type": "AddedToken",
    "content": "<ent>",
    "lstrip": false,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  },
  "entity_token_2": {
    "__type": "AddedToken",
    "content": "<ent2>",
    "lstrip": false,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  },
  "entity_unk_token": "[UNK]",
  "eos_token": "</s>",
  "mask_token": {
    "__type": "AddedToken",
    "content": "<mask>",
    "lstrip": true,
    "normalized": true,
    "rstrip": false,
    "single_word": false
  },
  "max_entity_length": 32,
  "max_mention_length": 30,
  "model_max_length": 512,
  "pad_token": "<pad>",
  "sep_token": "</s>",
  "sp_model_kwargs": {},
  "task": null,
  "tokenizer_class": "MLukeTokenizer",
  "tokenizer_file": "models/luke-japanese/hf_luke_japanese_lite_epoch20/tokenizer.json",
  "unk_token": "<unk>"
}
